wangdongshi/RTOS/rtos/TEST_FreeRTOS/Driver/src/stm32f746g_disco_driver.c
/**********************************************************************
 * Copyright (c) 2018 - 2021 by Wang Yu
 * All rights reserved
 *
 * Filename:  stm32f746g_disco_driver.c
 * Project:   Minimum RTOS platform
 * Date:      2021/9/5
 * Author:    Wang Yu
 *
 **********************************************************************/
#include <stdint.h>
#include <string.h>
#include "stm32f746xx.h"
#include "stm32f746g_disco_driver.h"
#include "image.h"

// Clock constant value definition
#define PLLM					((uint32_t)( 25 <<  0))
#define PLLN					((uint32_t)(432 <<  6))
#define PLLP					((uint32_t)(  0 << 16)) // pay attention to this value!!
#define PLLSRC					((uint32_t)(  1 << 22))
#define PLLQ					((uint32_t)(  9 << 24))

// GPIO register setting pattern definition
#define GPIO_MODER_IN			(0b0)
#define GPIO_MODER_OUT			(0b1)
#define GPIO_MODER_MULTI		(0b10)
#define GPIO_MODER_SIM			(0b11)
#define GPIO_OTYPER_PP			(0b0)
#define GPIO_OTYPER_OD			(0b1)
#define GPIO_OSPEEDR_LOW		(0b00)
#define GPIO_OSPEEDR_MID		(0b01)
#define GPIO_OSPEEDR_HIGH		(0b10)
#define GPIO_OSPEEDR_FULL		(0b11)
#define GPIO_PUPDR_NONE			(0b00)
#define GPIO_PUPDR_UP			(0b01)
#define GPIO_PUPDR_DOWN			(0b10)
#define GPIO_PUPDR_RESERVE		(0b11)
#define GPIO_AFR_AF7			(0b0111)

// LCD constant value definition
#define LCD_FRAME_BUF_SIZE		(LCD_COLOR_BYTES * LCD_ACTIVE_WIDTH * LCD_ACTIVE_HEIGHT)
#define LCD_COLOR_BYTES			(3)
#define LCD_ACTIVE_WIDTH		(480)
#define LCD_ACTIVE_HEIGHT		(272)
#define LCD_HSYNC				(41)
#define LCD_VSYNC				(10)
#define LCD_HBP					(13)
#define LCD_HFP					(32)
#define LCD_VBP					(2)
#define LCD_VFP					(2)

uint8_t __attribute__( ( section(".sdram" ) ) ) __attribute__( ( aligned(4) ) ) FrameBuffer[LCD_FRAME_BUF_SIZE];

static uint32_t readRegister(uint32_t addr, uint32_t shift, uint32_t len);
static void writeRegister(uint32_t addr, uint32_t data, uint32_t shift, uint32_t len);
static void writeRegThenWait(uint32_t addr, uint32_t data, uint32_t shift, uint32_t len);
static void writeRegMask(uint32_t addr, uint32_t mask, uint32_t data);
static void writeRegMaskThenWait(uint32_t addr, uint32_t mask, uint32_t data);
static void waitValueSet(uint32_t addr, uint32_t mask, uint32_t data);
static void waitBitsSet(uint32_t addr, uint32_t mask);
static __attribute__((unused)) void waitBitsClear(uint32_t addr, uint32_t mask);

static void initFPU(void);
static void initSDRAM(void);
static void initLCD(void);
static void initI2C3(void);
static void initSystemClock(void);
static void initNVICPriorityGroup(void);
static void initSystickInt(void);
static void initSVCallInt(void);
static void initPendSVInt(void);
static void initSystick(void);
static void initUSART1Int(void);
static void initLED1(void);
static void initUSART1(void);
static void initUartGPIO(void);
static void initLED1GPIO(void);
static void initSDRAMGPIO(void);
static void initLCDGPIO(void);
static void initDMA2D(void);
static void initTouchPanelGPIO(void);

#ifdef MODE_STAND_ALONE
static void initTIM7Int(void);
static void initTIM7(void);
#endif

// Hardware driver API
void SystemInit(void)
{
	SCB_EnableICache();
	SCB_EnableDCache();
	initFPU();
	initSystemClock();
	initSDRAM();
	initNVICPriorityGroup();
	initSVCallInt();
	initPendSVInt();
	initLED1();
	initLCD();
	initUSART1();
	initI2C3();
	initSystick();
#ifdef MODE_STAND_ALONE
	initTIM7();
#endif
}

void toggleLED1(void)
{
	uint32_t data = GPIOI->ODR & GPIO_ODR_OD1_Msk;
	GPIOI->ODR &= ~GPIO_ODR_OD1_Msk;
	GPIOI->ODR |= (~data) & GPIO_ODR_OD1_Msk;
}

void usart1SendChar(const uint8_t character)
{
	while((USART1->ISR & USART_ISR_TC_Msk) == 0);
	USART1->TDR = (uint32_t)character;
}

uint8_t usart1ReceiveChar(void)
{
	while((USART1->ISR & USART_ISR_RXNE_Msk) == 0);
	return (uint8_t)(USART1->RDR & 0xFF);
}

void usart1SendBuffer(const uint8_t* message)
{
	USART1->CR1	|= USART_CR1_TE;
	for(uint32_t i = 0; i < strlen((const char*)message); i++) {
		USART1->TDR = message[i];
		while((USART1->ISR & USART_ISR_TXE_Msk) == 0);
	}
	while((USART1->ISR & USART_ISR_TC_Msk) == 0);
	USART1->CR1	&= ~USART_CR1_TE;
}

uint32_t getRandomData(void)
{
	RCC->AHB2ENR |= RCC_AHB2ENR_RNGEN;
	while((RCC->AHB2ENR & RCC_AHB2ENR_RNGEN_Msk) == 0);

	RNG->CR = RNG_CR_RNGEN;
	while((RNG->SR & RNG_SR_DRDY_Msk) == 0);

	uint32_t random = RNG->DR;

	RCC->AHB2RSTR |= RCC_AHB2RSTR_RNGRST;
	return random;
}

uint32_t testMemoryDMA(uint16_t data)
{
	uint32_t  size = 0x8000;
	uint16_t* pSrc = &data;
	uint16_t* pDes = ((uint16_t*)_SDRAM_BANK1) + (uint32_t)(0x700000/sizeof(uint16_t));

	RCC->AHB1ENR |= RCC_AHB1ENR_DMA2EN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_DMA2EN_Msk) == 0);

	DMA2_Stream0->CR = 	DMA_SxCR_CHSEL_0 | // Stream0, channel1
						DMA_SxCR_PSIZE_0 | // src data 16bits
						DMA_SxCR_MSIZE_0 | // des data 16bits
						DMA_SxCR_MINC | 	// des address automatic increase
						DMA_SxCR_PL_0 | DMA_SxCR_PL_1 | // highest DMA priority
						DMA_SxCR_DIR_1; 	// memory to memory
	DMA2_Stream0->NDTR = size/sizeof(uint16_t);	 // 32768 / 2 = 16 K half word
	DMA2_Stream0->PAR  = (uint32_t)(pSrc);
	DMA2_Stream0->M0AR = (uint32_t)(pDes);

	DMA2_Stream0->CR |= DMA_SxCR_EN; // start DMA transfer

	while(DMA2_Stream0->NDTR != 0);  // wait transfer complete
	DMA2->LIFCR |= DMA_LIFCR_CTCIF0; // must clear TC interrupt flag for next DMA

	RCC->AHB1RSTR |= RCC_AHB1RSTR_DMA2RST;

	return (*((uint16_t*)0xC0700000) == data && *((uint16_t*)0xC0700000 + 0x3FF8) == data);
}

void showLogo(void)
{
	uint32_t size = LCD_FRAME_BUF_SIZE / sizeof(uint32_t) / 2; // it must lower than 65535

	// Open DMA RRC
	RCC->AHB1ENR |= RCC_AHB1ENR_DMA2EN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_DMA2EN_Msk) == 0);

	// RGB888 above half frame (48960 uint32_t)
	DMA2_Stream0->CR = 	DMA_SxCR_CHSEL_0 |	// Stream0, channel1
						DMA_SxCR_PSIZE_1 |	// src data 32bits
						DMA_SxCR_MSIZE_1 |	// des data 32bits
						DMA_SxCR_PINC |		// src address automatic increase
						DMA_SxCR_MINC |		// des address automatic increase
						DMA_SxCR_PL_0 | DMA_SxCR_PL_1 | // highest DMA priority
						DMA_SxCR_DIR_1; 	// memory to memory
	DMA2_Stream0->NDTR = size;
	DMA2_Stream0->PAR  = (uint32_t)&logoImage;
	DMA2_Stream0->M0AR = (uint32_t)&FrameBuffer;
	DMA2_Stream0->CR |= DMA_SxCR_EN;  // start DMA transfer
	while((DMA2->LISR & DMA_LISR_TCIF0_Msk) == 0);   // wait transfer complete
	DMA2->LIFCR |= DMA_LIFCR_CTCIF0;  // must clear TC interrupt flag for next DMA

	// RGB888 below half frame (48960 uint32_t)
	DMA2_Stream0->CR = 	DMA_SxCR_CHSEL_0 |	// Stream0, channel1
						DMA_SxCR_PSIZE_1 |	// src data 32bits
						DMA_SxCR_MSIZE_1 |	// des data 32bits
						DMA_SxCR_PINC |		// src address automatic increase
						DMA_SxCR_MINC |		// des address automatic increase
						DMA_SxCR_PL_0 | DMA_SxCR_PL_1 | // highest DMA priority
						DMA_SxCR_DIR_1; 	// memory to memory
	DMA2_Stream0->NDTR = size;
	DMA2_Stream0->PAR  = (uint32_t)((uint32_t*)&logoImage + size);
	DMA2_Stream0->M0AR = (uint32_t)((uint32_t*)&FrameBuffer + size);
	DMA2_Stream0->CR |= DMA_SxCR_EN; // start DMA transfer
	while((DMA2->LISR & DMA_LISR_TCIF0_Msk) == 0);   // wait transfer complete
	DMA2->LIFCR |= DMA_LIFCR_CTCIF0; // must clear TC interrupt flag for next DMA

	// close DMA RRC
	RCC->AHB1RSTR |= RCC_AHB1RSTR_DMA2RST;
}

void FillRect(uint32_t x, uint32_t y, uint32_t w, uint32_t h, uint32_t color)
{
	DMA2D->CR 		&= ~DMA2D_CR_MODE_Msk;
	DMA2D->CR 		|= 0b11 << DMA2D_CR_MODE_Pos; // register to memory
	DMA2D->OCOLR	= color;
	DMA2D->OMAR		= (uint32_t)(&(((uint8_t*)&FrameBuffer)[(y * LCD_ACTIVE_WIDTH + x) * LCD_COLOR_BYTES]));
	DMA2D->OOR		= LCD_ACTIVE_WIDTH - w;
	DMA2D->OPFCCR	= 0b01;
	DMA2D->NLR		= w << DMA2D_NLR_PL_Pos | h << DMA2D_NLR_NL_Pos;

	DMA2D->CR   	|= DMA2D_CR_START;
	while (DMA2D->CR & DMA2D_CR_START);
}

// General register(4 bytes) operation function
static uint32_t readRegister(uint32_t addr, uint32_t shift, uint32_t len)
{
	uint32_t* reg = (uint32_t*)addr;
	uint32_t  val = *reg; // read from register
	uint32_t  mask = 0x00000000;

	// set mask
	for (uint32_t i = 0; i < 32; i++) {
		if (i >= shift && i < shift + len)
			mask |= (1 << i);
	}
	mask = ~mask;

	// set data
	val = (val & ~mask) >> shift;
	return val;
}

static void writeRegister(uint32_t addr, uint32_t data, uint32_t shift, uint32_t len)
{
	uint32_t* reg = (uint32_t*)addr;
	uint32_t  val = *reg; // read from register
	uint32_t  mask = 0x00000000;

	// set mask
	for (uint32_t i = 0; i < 32; i++) {
		if (i >= shift && i < shift + len)
			mask |= (1 << i);
	}
	mask = ~mask;

	// set data
	val &= mask;					// clear bits
	val |= (data << shift) & ~mask; // set bits
	*reg = val;						// write back to register
}

static void writeRegThenWait(uint32_t addr, uint32_t data, uint32_t shift, uint32_t len)
{
	uint32_t* reg = (uint32_t*)addr;
	uint32_t  val = *reg; // read from register
	uint32_t  mask = 0x00000000;

	// set mask
	for (uint32_t i = 0; i < 32; i++) {
		if (i >= shift && i < shift + len)
			mask |= (1 << i);
	}
	mask = ~mask;

	// set data
	val &= mask;					// clear bits
	val |= (data << shift) & ~mask; // set bits
	*reg = val;						// write back to register
	while(*reg != val);				// wait for set complete
}

static void writeRegMask(uint32_t addr, uint32_t mask, uint32_t data)
{
	volatile uint32_t* reg = (uint32_t*)addr;
	uint32_t val = *reg; 	// read from register

	// set data
	val &= mask;			// clear bits
	val |= data & (~mask);	// set bits
	*reg = val;				// write back to register
}

static void writeRegMaskThenWait(uint32_t addr, uint32_t mask, uint32_t data)
{
	volatile uint32_t* reg = (uint32_t*)addr;
	uint32_t val = *reg; 	// read from register

	// set data
	val &= mask;			// clear bits
	val |= data & (~mask);	// set bits
	*reg = val;				// write back to register
	while(*reg != val);		// wait for set complete
}

static void waitValueSet(uint32_t addr, uint32_t mask, uint32_t data)
{
	volatile uint32_t* reg = (uint32_t*)addr;
	while((*reg & ~mask) != data);

