wangdongshi/RTOS/rtos/TEST_FreeRTOS/Driver/src/stm32f746g_disco_driver.c
}

static void waitBitsSet(uint32_t addr, uint32_t mask)
{
	volatile uint32_t* reg = (uint32_t*)addr;
	while((*reg & ~mask) == 0);
}

static void waitBitsClear(uint32_t addr, uint32_t mask)
{
	volatile uint32_t* reg = (uint32_t*)addr;
	while((*reg & ~mask) != 0);
}

// The following initialization process is write for STM32F746G-DISCO
// FPU initialization
static void initFPU(void)
{
	SCB->CPACR |= 	0b11 << 20 | // CP10
					0b11 << 22;  // CP11
	while((SCB->CPACR & (0b1111 << 20)) != (0b1111 << 20));
}

// System clock initialization
static void initSystemClock(void)
{
	// 1. Set HSE and reset RCC_CIR
	RCC->CR |= RCC_CR_HSEBYP | RCC_CR_HSEON;
	while((RCC->CR & RCC_CR_HSERDY_Msk) == 0);
	RCC->CIR = 0x00000000; // disable all RCC interrupts

	// 2. Set FLASH latency
	FLASH->ACR |= FLASH_ACR_LATENCY_7WS; // need be set in 216MHz
	while((FLASH->ACR & FLASH_ACR_LATENCY_Msk) != FLASH_ACR_LATENCY_7WS);
	//FLASH->ACR |= FLASH_ACR_ARTEN | FLASH_ACR_PRFTEN;
	//PWR->CR1 |= 0b11 << PWR_CR1_VOS_Pos; // default value has set to 0b11 in reset

	// 3. Enable PWR clock
	RCC->APB1ENR |= RCC_APB1ENR_PWREN;
	while((RCC->APB1ENR & RCC_APB1ENR_PWREN_Msk) == 0);

	// 4. Activation OverDrive Mode
	PWR->CR1 |= PWR_CR1_ODEN;
	while((PWR->CSR1 & PWR_CSR1_ODRDY_Msk) == 0);

	// 5. Activation OverDrive Switching
	PWR->CR1 |= PWR_CR1_ODSWEN;
	while((PWR->CSR1 & PWR_CSR1_ODSWRDY_Msk) == 0);

	// 6. Main PLL configuration and activation
	RCC->PLLCFGR = PLLM | PLLN | PLLP | PLLSRC | PLLQ;
	RCC->CR |= RCC_CR_PLLON;
	while((RCC->CR & RCC_CR_PLLRDY_Msk) == 0);

	// 7. System clock activation on the main PLL
	RCC->CFGR |=	RCC_CFGR_HPRE_DIV1 |	 // set HPRE  (AHB  pre-scaler) to 1 (216 MHz)
					RCC_CFGR_PPRE1_DIV4 |	 // set PPRE1 (APB1 pre-scaler) to 4 (54  MHz)
					RCC_CFGR_PPRE2_DIV2;	 // set PPRE2 (APB2 pre-scaler) to 2 (108 MHz)
	// Attention : before switching System clock to PLL, it must wait all pre-scale value set to CFGR.
	while((RCC->CFGR & (RCC_CFGR_HPRE_Msk | RCC_CFGR_PPRE1_Msk | RCC_CFGR_PPRE2_Msk)) !=
		(RCC_CFGR_HPRE_DIV1 | RCC_CFGR_PPRE1_DIV4 | RCC_CFGR_PPRE2_DIV2));
	RCC->CFGR |=	RCC_CFGR_SW_PLL; // switch main clock to PLL
	while((RCC->CFGR & RCC_CFGR_SWS_Msk) != RCC_CFGR_SWS_PLL);
}

// Set global NVIC priority group
static void initNVICPriorityGroup(void)
{
	// STM32F756XX-PM can not refer here, because ST has own design in interrupt priority.
	// ST interrupt priority group setting can refer to the following.
	//   IPR just use the higher 4 bit indicating priority, the lower 4 bit should be set to 0.
	//   The assignment of AIRCR-PRIGROUP can be refer to the following rule.
	//   ----------------|------------------------------------------------
	//                   |                  IPRn / SHPRn
	//    AIRCR-PRIGROUP |------------------------------------------------
	//                   |  preemption priority  |    sub-priority
	//   ----------------|------------------------------------------------
	//     0xb011 :      |  [7:4], 16 level      |    None , None
	//     0xb100 :      |  [7:5], 8 level       |    [4]  , 2 level
	//     0xb011 :      |  [7:6], 4 level       |    [5:4], 4 level
	//     0xb011 :      |  [7]  , 2 level       |    [6:4], 8 level
	//     0xb011 :      |  None , None          |    [7:4], 16 level
	//   ----------------|------------------------------------------------

	// "|=" can not be used here, because VECTKEY write key is "0x05FA" and "|=" will change it
	SCB->AIRCR =	0x05FA << SCB_AIRCR_VECTKEY_Pos |
					0b011  << SCB_AIRCR_PRIGROUP_Pos; // PRIGROUP = 0b011 (preemption:16, sub:0)
	while((SCB->AIRCR & SCB_AIRCR_PRIGROUP_Msk) != (0b011 << SCB_AIRCR_PRIGROUP_Pos));

	// Global interrupt design in sample project can refer to the following setting.
	// SVC(FreeRTOS)		: preemption:10, IRQn:11
	// PendSV(FreeRTOS)		: preemption:15, IRQn:14
	// Systick(FreeRTOS)	: preemption:6,  IRQn:15
	// USART1(Debug)		: preemption:14, IRQn:37
	// TIMER7(LED1 flicker)	: preemption:14, IRQn:55
}

// Initialize USART1 interrupt
static void initUSART1Int(void)
{
	NVIC->IP[9]   |= 14 << (8 + 4); // Set USART1 interrupt priority
	NVIC->ISER[1] |= 0b1 << (37 - 32); // Enable USART1 global interrupt (IRQn=37)
}

// Initialize SVCall interrupt (IRQn:11)
static void initSVCallInt(void)
{
	SCB->SHPR[2] |= 10 << (24 + 4); // Set SVCall interrupt priority
	// SVC need not open. Executing SVC instrument will trigger SVC interrupt.
}

// Initialize PendSV interrupt (IRQn:14)
static void initPendSVInt(void)
{
	SCB->SHPR[3] |= 15 << (16 + 4); // Set PendSV interrupt priority
	// PendSV need not open. Setting ICSR the 28th bit will trigger pendSV interrupt.
}

// Initialize Systick interrupt (IRQn:15)
static void initSystickInt(void)
{
	SCB->SHPR[3]  |= 6 << (24 + 4); // Set Systick interrupt priority
	SysTick->CTRL |= 0b1 << SysTick_CTRL_TICKINT_Pos; // Enable Systick global interrupt
}

// LED1 initialization
static void initLED1(void)
{
	initLED1GPIO();
}

// USART1 initialization
static void initUSART1(void)
{
	// Initialize USART1 TX/RX pin
	initUartGPIO();

	// Enable APB2 USART1 RCC
	RCC->APB2ENR |= RCC_APB2ENR_USART1EN;
	while((RCC->APB2ENR & RCC_APB2ENR_USART1EN_Msk) == 0);

	// Set USART1 parameter
	//USART1->BRR = 0x2BF2;	// baud rate = 9600(fCK=108MHz, CR1/OVER8=0, 0x2BF2 = 108000000/9600)
	USART1->BRR = 0x03AA;	// baud rate = 15200(fCK=108MHz, CR1/OVER8=0, 0x03AA = 108000000/115200)
	USART1->CR1 &= ~USART_CR1_M;	// data bits = 8(M[1:0]=00)
	USART1->CR2 &= ~USART_CR2_STOP;	// stop bits = 1(STOP[1:0]=00)
	USART1->CR1 &= ~USART_CR1_PCE;	// parity = off(parity = on, odd:0x00000600, even:0x00000400)
	USART1->CR3 &= ~(USART_CR3_CTSE | USART_CR3_RTSE); // disable CTS and RTS

	// Enable USART1 global interrupt
	initUSART1Int();

	// Disable RX interrupt in console log mode
	//USART1->CR1 |&= USART_CR1_RXNEIE;

	// Enable USART1
	USART1->CR1 |= USART_CR1_UE;

	// Enable TX and RE
	USART1->CR1 |= USART_CR1_TE | USART_CR1_RE;
}

// System tick initialization
static void initSystick(void)
{
	// Enable Systick global interrupt
	initSystickInt();

	// Set RELOAD value (216000000 / 1000 = 216000)
	SysTick->LOAD = 0x00034BC0 - 1;

	// Set current value by default value
	//SysTick->VAL = 0x00000000;

	// Set CLKSOURCE, ENABLE
	SysTick->CTRL |= 	0b1 << SysTick_CTRL_CLKSOURCE_Pos |	// clk-source : processor clock
						0b1 << SysTick_CTRL_ENABLE_Pos;		// enable systick counter
}

#ifdef MODE_STAND_ALONE
// Initialize TIM7 interrupt
static void initTIM7Int(void)
{
	// Set TIM7 interrupt priority for LED1 flicker
	NVIC->IP[13]   |= 14 << (24 + 4);

	// Enable TIM7 global interrupt (IRQn=55)
	NVIC->ISER[1] |= 0b1 << (55 - 32);

	// Enable TIM7 update interrupt
	TIM7->DIER |= TIM_DIER_UIE;
}

// TIM7 initialization for low speed timer(500ms)
static void initTIM7(void)
{
	// Enable APB1 TIM7 RCC
	RCC->APB1ENR |= RCC_APB1ENR_TIM7EN;
	while((RCC->APB1ENR & RCC_APB1ENR_TIM7EN_Msk) == 0);
	
	// Enable TIM7 interrupt
	initTIM7Int();

	// Initialize TIM7
	TIM7->CR1 |= TIM_CR1_ARPE;			// Enable pre-load ARPE
	TIM7->PSC = 4000 - 1;				// timer frequency = 108MHz / 4000 = 27KHz (APB pre-sacle is not 1, so fCK_PSC = 54MHz * 2 = 108MHz)
	TIM7->CNT &= TIM_CNT_UIFCPY_Msk;	// set bit[30:0] to 0
	TIM7->SR  &= ~TIM_SR_UIF;			// Clear timer update interrupt flag
	TIM7->ARR = 13500 - 1;				// Set 13500 to reload value
	TIM7->CR1 |= TIM_CR1_CEN;			// Enable TIM7 CEN
}
#endif

// USART TX pin initialization (TX:GPIOA9, RX:GPIOB7)
static void initUartGPIO(void)
{
	/*
	writeRegThenWait(RCC_AHB1ENR, 1, 0, 1);
	writeRegThenWait(GPIOA_MODER,	GPIO_MODER_MULTI,	9*2,		2);
	writeRegThenWait(GPIOA_OTYPER,	GPIO_OTYPER_PP,		9,			1);
	writeRegThenWait(GPIOA_OSPEEDR,	GPIO_OSPEEDR_FULL,	9*2,		2);
	writeRegThenWait(GPIOA_PUPDR,	GPIO_PUPDR_UP,		9*2,		2);
	writeRegThenWait(GPIOA_AFRH,	GPIO_AFR_AF7,		(9-8)*4,	4);

	writeRegThenWait(RCC_AHB1ENR, 1, 1, 1);
	writeRegThenWait(GPIOB_MODER,	GPIO_MODER_MULTI,	7*2,		2);
	writeRegThenWait(GPIOB_OTYPER,	GPIO_OTYPER_PP,		7,			1);
	writeRegThenWait(GPIOB_AFRL,	GPIO_AFR_AF7,		7*4,		4);
	*/
	writeRegMask(RCC_AHB1ENR,	~0x00000001,	0x00000001);
	writeRegMask(GPIOA_MODER,	~0x000C0000,	0x00080000);
	writeRegMask(GPIOA_OTYPER,	~0x00000200,	0x00000000);
	writeRegMask(GPIOA_OSPEEDR,	~0x000C0000,	0x000C0000);
	writeRegMask(GPIOA_PUPDR,	~0x000C0000,	0x00040000);
	writeRegMask(GPIOA_AFRH,	~0x000000F0,	0x00000070);

	writeRegMask(RCC_AHB1ENR,	~0x00000002,	0x00000002);
	writeRegMask(GPIOB_MODER,	~0x000C0000,	0x00080000);
	writeRegMask(GPIOB_OTYPER,	~0x00000200,	0x00000000);
	// RX line need not to set OSPEEDR and PUPDR
	writeRegMask(GPIOB_AFRL,	~0xF0000000,	0x70000000);
}

// LED1 pin initialization (GPIOI1)
static void initLED1GPIO(void)
{
	writeRegThenWait(RCC_AHB1ENR,	0b1, 8, 1);
	writeRegThenWait(GPIOI_MODER,	GPIO_MODER_OUT,		1*2,		2);
	writeRegThenWait(GPIOI_OTYPER,	GPIO_OTYPER_PP,		1,			1);
	writeRegThenWait(GPIOI_OSPEEDR,	GPIO_OSPEEDR_FULL,	1*2,		2);
	writeRegThenWait(GPIOI_PUPDR,	GPIO_PUPDR_UP,		1*2,		2);

