wangdongshi/RTOS/rtos/TEST_FreeRTOS/Driver/src/stm32f746g_disco_driver.c
	// GPIOI12 --> LCD_DISP (must be manually controlled)
	GPIOI->MODER	|=	0b01 << GPIO_MODER_MODER12_Pos;		// MODER = Output(0b01)
	GPIOI->OTYPER	|=	0b0  << GPIO_OTYPER_OT12_Pos;		// OTYPER = PP
	GPIOI->BSRR		|=	0b1  << GPIO_BSRR_BS12_Pos;			// Bit Set

	// GPIOK3  --> LCD_BL_CTRL (must be manually controlled)
	GPIOK->MODER	|=	0b01 << GPIO_MODER_MODER3_Pos;		// MODER = Output(0b01)
	GPIOK->OTYPER	|=	0b0  << GPIO_OTYPER_OT3_Pos;		// OTYPER = PP
	GPIOK->BSRR		|=	0b1  << GPIO_BSRR_BS3_Pos;			// Bit Set
}

// Touch panel pin initialization
static void initTouchPanelGPIO(void)
{
	// GPIOH RCC
	RCC->AHB1ENR	|=	RCC_AHB1ENR_GPIOHEN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_GPIOHEN_Msk) == 0);
	// PH7  --> I2C3_SCL (for FT5336 Control)
	// PH8  --> I2C3_SDA (for FT5336 Control)
	GPIOH->MODER	|=	0b10	<< GPIO_MODER_MODER7_Pos |	// MODER = Multiple(0b10)
						0b10	<< GPIO_MODER_MODER8_Pos;
	GPIOH->OTYPER	|=	0b1		<< GPIO_OTYPER_OT7_Pos |	// Open Drain
						0b1		<< GPIO_OTYPER_OT8_Pos;
	GPIOH->OSPEEDR	|=	0b11	<< GPIO_OSPEEDR_OSPEEDR7_Pos | // Very high speed
						0b11	<< GPIO_OSPEEDR_OSPEEDR8_Pos;
	GPIOH->PUPDR	|=	0b01	<< GPIO_PUPDR_PUPDR7_Pos |	// Pull-up
						0b01	<< GPIO_PUPDR_PUPDR8_Pos;
	GPIOH->AFR[0]	|=	4		<< GPIO_AFRL_AFRL7_Pos;		// AF = AF4
	GPIOH->AFR[1]	|=	4		<< GPIO_AFRH_AFRH0_Pos;		// AF = AF4

	// GPIOI RCC
	RCC->AHB1ENR	|=	RCC_AHB1ENR_GPIOIEN;
	while((RCC->AHB1ENR & RCC_AHB1ENR_GPIOIEN_Msk) == 0);
	// PI13 --> LCD_INT (for FT5336 Control)
	GPIOI->MODER	|=	0b10	<< GPIO_MODER_MODER15_Pos;	// MODER = Multiple(0b10)
	GPIOI->AFR[1]	|=	15		<< GPIO_AFRH_AFRH5_Pos;		// AF = AF15
}

// I2C3 controller initialization (for touch panel)
static void initI2C3(void)
{
	// Initialize GPIO for I2C3
	initTouchPanelGPIO();

	// Enable I2C3 RCC
	RCC->APB1ENR	|=	RCC_APB1ENR_I2C3EN;
	while((RCC->APB1ENR & RCC_APB1ENR_I2C3EN_Msk) == 0);

	// Set I2C3 clock
	RCC->DCKCFGR2	&=	~RCC_DCKCFGR2_I2C3SEL_Msk;
	RCC->DCKCFGR2	|=	0b00 << RCC_DCKCFGR2_I2C3SEL_Pos; // APB1 clock (54MHz)

	// Set I2C3 register
	I2C3->CR1		&=	~I2C_CR1_PE_Msk;
	I2C3->TIMINGR	=	0x30C03444; // calculate by CubeMX (I2C Frequency = 100KHz, Rise time = 700ns, Fall time = 100ns)
	//I2C3->TIMINGR	=	0x40912732; // from ST sample
	//I2C3->TIMINGR	=	0x20404768; // from https://github.com/haidongqing/i2c3test-xy/blob/master/
	I2C3->OAR1		&=	~(I2C_OAR1_OA1_Msk | I2C_OAR1_OA1MODE_Msk | I2C_OAR1_OA1EN_Msk);
	I2C3->OAR1		|=	0b1 << I2C_OAR1_OA1EN_Pos;

	// Reset I2C3
	while(I2C3->CR1 & I2C_CR1_PE_Msk);
	I2C3->CR1		|=	I2C_CR1_PE;
}

// for 7bits slave address and 8bits memory address
void i2c3Write1Byte(uint8_t slaveAddr, uint8_t devAddr, uint8_t data)
{
	// Wait previous I2C operation complete
	while (I2C3->ISR & I2C_ISR_BUSY);

	// Set master communication to write mode for send device address and data
	I2C3->CR2	=	I2C_CR2_AUTOEND |
					2 << I2C_CR2_NBYTES_Pos | // send 2 bytes (address + data)
					I2C_CR2_START |
					0b0 << I2C_CR2_RD_WRN_Pos | // write
					slaveAddr << I2C_CR2_SADD_Pos;

	// Send device address and data
	while ((I2C3->ISR & I2C_ISR_TXIS_Msk) == 0);
	I2C3->TXDR	=	devAddr;
	while ((I2C3->ISR & I2C_ISR_TXIS_Msk) == 0);
	I2C3->TXDR	=	data;
	while ((I2C3->ISR & I2C_ISR_TC_Msk) == 0);
	while ((I2C3->ISR & I2C_ISR_STOPF_Msk) == 0);
	I2C3->ICR	|=	I2C_ICR_STOPCF;
}

// for 7bits slave address and 8bits memory address
uint8_t i2c3Read1Byte(uint8_t slaveAddr, uint8_t devAddr)
{
	uint8_t data;

	// Wait previous I2C operation complete
	while (I2C3->ISR & I2C_ISR_BUSY_Msk);

	// Set master communication to write mode for send device address
	I2C3->CR2	=	1 << I2C_CR2_NBYTES_Pos |
					I2C_CR2_START |
					0b0 << I2C_CR2_RD_WRN_Pos | // write
					slaveAddr << I2C_CR2_SADD_Pos;
	while ((I2C3->ISR & I2C_ISR_TXIS_Msk) == 0);
	I2C3->TXDR	=	devAddr;
	while ((I2C3->ISR & I2C_ISR_TC_Msk) == 0);

	// Set master communication to read mode for receive data
	I2C3->CR2	=	I2C_CR2_AUTOEND |
					1 << I2C_CR2_NBYTES_Pos |
					I2C_CR2_START |
					0b1 << I2C_CR2_RD_WRN_Pos | // read
					slaveAddr << I2C_CR2_SADD_Pos;
	while ((I2C3->ISR & I2C_ISR_RXNE_Msk) == 0);
	data		=	(uint8_t)I2C3->RXDR;
	while ((I2C3->ISR & I2C_ISR_STOPF_Msk) == 0);
	I2C3->ICR	|=	I2C_ICR_STOPCF;

	return data;
}

// SDRAM initialization
static void initSDRAM(void)
{
	// Initialize GPIO for FMC
	initSDRAMGPIO();

	// Enable FMC RCC
	writeRegMaskThenWait(RCC_AHB3ENR, ~0x00000001, 0x00000001);

	// The following comment is copied from STM32F746G data-sheet FMC-SDRAM chapter.
	// Set MCU-FMC register
	// 1. Program the memory device features into the FMC_SDCRx register.
	//    The SDRAM clock frequency, RBURST and RPIPE must be programmed in
	//    the FMC_SDCR1 register.
	uint32_t NC     = 0b00 << 0;	// 8 bits
	uint32_t NR     = 0b01 << 2;	// 12 bits
	uint32_t NWID   = 0b01 << 4;	// 16 bits
	uint32_t NB     = 0b1 << 6;		// 4 banks
	uint32_t CAS    = 0b11 << 7;	// 3 cycles
	uint32_t WP     = 0b0 << 9;		// enable write operation
	uint32_t SDCLK  = 0b10 << 10;	// HCLK x 2 = 108MHz = 9.26ns
	uint32_t RBURST = 0b1 << 12;	// enable burst mode
	uint32_t RPIPE  = 0b0 << 13;	// 0 latency after CAS
	uint32_t SDCR   = NC | NR | NWID | NB | CAS | WP | SDCLK | RBURST | RPIPE;
	writeRegMaskThenWait(FMC_SDCR1, ~0x00007FFF, SDCR);

	// 2. Program the memory device timing into the FMC_SDTRx register.
	//    The TRP and TRC timings must be programmed in the FMC_SDTR1 register.
	uint32_t TMRD	= 1 << 0;		// 1 cycle : uncertain !
	uint32_t TXSR	= 8 << 4;		// 8 x 9.26 = 74.08ns > tXSR(70ns)
	uint32_t TRAS	= 3 << 8;		// 3 x 9.26 = 27.78ns < tRFC(70ns) : uncertain !
	uint32_t TRC	= 8 << 12;		// 8 x 9.26 = 74.08ns > tRC(70ns)
	uint32_t TWR	= 3 << 16;		// 3 x 9.26 = 27.78ns > tWR(1CLK+7ns or 14ns) : uncertain !
	uint32_t TRP	= 3 << 20;		// 3 x 9.26 = 27.78ns > tRP(20ns)
	uint32_t TRCD	= 3 << 24;		// 3 x 9.26 = 27.78ns < tRCD(20ns)
	uint32_t SDTR	= TMRD | TXSR | TRAS | TRC | TWR | TRP | TRCD;
	writeRegMaskThenWait(FMC_SDTR1, ~0x0FFFFFFF, SDTR);

	// Set SDRAM-MODE register
	uint32_t MODE, CTB1, NRFS, MRD, SDCMR;
	// 3. Set MODE bits to ‘001’ and configure the Target Bank bits
	//    (CTB1 and/or CTB2) in the	FMC_SDCMR register to start delivering
	//    the clock to the memory (SDCKE is driven high).
	MODE	= 0b001 << 0;	// clock assign enable
	CTB1	= 0b1 << 4;		// CTB1 enable
	NRFS	= 0 << 5;		// not use
	MRD		= 0 << 9;		// not use
	SDCMR	= MODE | CTB1 | NRFS | MRD;
	writeRegMask(FMC_SDCMR, ~0x003FFFFF, SDCMR);

	// 4. Wait during the prescribed delay period. Typical delay is around
	//    100 us (refer to the SDRAM datasheet for the required delay after power-up).
	for (volatile uint32_t i = 0; i < 50000; i++); // at least 100 us delay here, (216MHz = 4.63ns, 100us / 2.63ns = 21598)

